class Template:
    START = "Вас вітає Flagrate Movie Bot! Введіть /search [назва фільму] для пошуку фільму."
    START_DB_ERROR = "💔 Щось пішло не так. Спробуйте команду /start ще раз пізніше\nФункціонал обраних фільмів тимчасово недоступний"
    
    SEARCH_NOT_FOUND = "💔 Нічого не знайдено. Спробуйте інший пошуковий запит або англійську мову"
    SEARCH_NO_ARGS = "💔 Неправильне використання команди, введіть параметри пошуку."

    FAVORITES_ADD_BUTTON = "❤️ Додати до обраного"
    FAVORITES_REMOVE_BUTTON = "❌ Видалити з обраного"
    
    FAVORITES_ADDED_ALERT = "✅ Фільм додано до обраного"
    FAVORITES_REMOVED_ALERT = "❌ Фільм видалено з обраного"
    
    FAVORITES_SHOW = "❤️ Обрані фільми:"
    FAVORITES_EMPTY = "😞 У Вас поки немає обраних фільмів"